src_Extension/Reports/ГрафикПроизводства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ГрафикПроизводства</Name>
		</Properties>
	</Report>
</MetaDataObject>

src_Extension/InformationRegisters/ДополнительныеСведения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ДополнительныеСведения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_Extension/Enums/СтатусыЭтаповПроизводства2_2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СтатусыЭтаповПроизводства2_2</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Начат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Завершен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КВыполнению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сформирован</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src_Extension/Catalogs/СтруктураПредприятия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СтруктураПредприятия</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИспользоватьСерииНоменклатуры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ГрафикиРаботы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ГрафикРаботы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Календари</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src_Extension/Reports/ГрафикПроизводства/Ext/ObjectModule.bsl
&НаСервере
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;   
	НайденныйПараметрВарианта = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ГруппаСпецификаций");
	Если НайденныйПараметрВарианта <> Неопределено Тогда
		НайденныйПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(НайденныйПараметрВарианта.ИдентификаторПользовательскойНастройки);
	КонецЕсли;
	Если НайденныйПараметр <> Неопределено И НайденныйПараметр.Использование тогда
		ГруппаСпецификаций = НайденныйПараметр.Значение;
	КонецЕсли;		
	НайденныйПараметрВарианта = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ГруппаВидовНоменклатуры");
	Если НайденныйПараметрВарианта <> Неопределено Тогда
		НайденныйПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(НайденныйПараметрВарианта.ИдентификаторПользовательскойНастройки);
		Если НайденныйПараметр <> Неопределено И НайденныйПараметр.Использование тогда
			ГруппаВидовНоменклатуры = НайденныйПараметр.Значение;
		КонецЕсли;
	КонецЕсли;
	
	НайденныйПараметрВарианта = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ПодразделениеОтбор");
	Если НайденныйПараметрВарианта <> Неопределено Тогда
		НайденныйПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(НайденныйПараметрВарианта.ИдентификаторПользовательскойНастройки);
		Если НайденныйПараметр <> Неопределено И НайденныйПараметр.Использование тогда
			ПодразделениеОтбор = НайденныйПараметр.Значение;
		КонецЕсли;
	КонецЕсли;

	НайденныйПараметрВарианта = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("КонтрагентОтбор");
	Если НайденныйПараметрВарианта <> Неопределено Тогда
		НайденныйПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(НайденныйПараметрВарианта.ИдентификаторПользовательскойНастройки);
		Если НайденныйПараметр <> Неопределено И НайденныйПараметр.Использование тогда
			КонтрагентОтбор = НайденныйПараметр.Значение;
		КонецЕсли;
	КонецЕсли;
	
	
	НайденныйПараметрВарианта = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НаименованиеСодержит");
	Если НайденныйПараметрВарианта <> Неопределено Тогда
		НайденныйПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(НайденныйПараметрВарианта.ИдентификаторПользовательскойНастройки);
		Если НайденныйПараметр <> Неопределено И НайденныйПараметр.Использование тогда
			НаименованиеСодержит = НайденныйПараметр.Значение;
		КонецЕсли;
	КонецЕсли;

	НайденныйПараметрВарианта = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаДо");
	Если НайденныйПараметрВарианта <> Неопределено Тогда
		НайденныйПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(НайденныйПараметрВарианта.ИдентификаторПользовательскойНастройки);
		Если НайденныйПараметр <> Неопределено И НайденныйПараметр.Использование тогда
			ДатаДо = НайденныйПараметр.Значение;
		КонецЕсли;
	КонецЕсли;

	
	Попытка 
		
		ТаблицаЭтапов = ТаблицаЭтаповДляГрафикаПроизводства(ГруппаСпецификаций, ГруппаВидовНоменклатуры, КонтрагентОтбор, ПодразделениеОтбор, НаименованиеСодержит, ДатаДо); 
		
		ВнешниеНаборыДанных = Новый Структура;
		ВнешниеНаборыДанных.Вставить("ТаблицаЭтапов", ТаблицаЭтапов);
		
		Настройки = КомпоновщикНастроек.Настройки;
		
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
		
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
		
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
		ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
		ПроцессорВывода.Вывести(ПроцессорКомпоновки);
		
		// Вывод описания параметров под отчётом
		ВывестиОписаниеПараметров(ДокументРезультат);

	Исключение
		Сообщить("Ошибка получения данных");
	КонецПопытки;	

КонецПроцедуры

&НаСервере
Процедура ВывестиОписаниеПараметров(ДокументРезультат)
	
	ТекстОписания = "
	|
	|Описание параметров отчета
	|==========================
	|
	|Отчет показывает незавершенные этапы производства.
	|Выводятся этапы со статусами: Сформирован, К выполнению, Начат.
	|Выводятся этапы с невыпущенным количеством (план - факт - отменено > 0).
	|
	|ГРУППА СПЕЦИФИКАЦИЙ - фильтр по группе ресурсных спецификаций:
	|  * Указана - только этапы с данной группой спецификации
	|  * Не указано - все этапы без фильтра по спецификации
	|
	|ГРУППА ВИДОВ НОМЕНКЛАТУРЫ - фильтр по группе видов номенклатуры:
	|  * Указана - этапы с номенклатурой данной группы (проверяется родитель и родитель родителя вида)
	|  * Не указано - все этапы без фильтра по виду номенклатуры
	|
	|ПОДРАЗДЕЛЕНИЕ - фильтр по подразделению этапа производства:
	|  * Указано - только этапы данного подразделения
	|  * Не указано - все подразделения
	|
	|КОНТРАГЕНТ - фильтр по контрагенту из заказа клиента:
	|  * Указан - только этапы по заказам данного контрагента
	|  * Не указано - все контрагенты
	|
	|НАИМЕНОВАНИЕ СОДЕРЖИТ - текстовый поиск по наименованию номенклатуры:
	|  * Указано - фильтрует по вхождению текста в наименование (выходные и побочные изделия)
	|  * Не указано - без фильтра по наименованию
	|
	|ДАТА ДО - фильтр по дате потребности из заказа на производство:
	|  * Указана - только этапы с датой потребности до указанной даты (включительно)
	|  * Не указано - все даты
	|  * Примечание: если дата потребности в заказе не заполнена, используется дата документа заказа
	|";
	
	// Вывод текста описания построчно
	СтрокиОписания = СтрРазделить(ТекстОписания, Символы.ПС, Ложь);
	Для Каждого СтрокаОписания Из СтрокиОписания Цикл
		МакетСтроки = Новый ТабличныйДокумент;
		ОбластьСтроки = МакетСтроки.ПолучитьОбласть(1, 1, 1, 1);
		ОбластьСтроки.Область(1, 1).Текст = СтрокаОписания;
		ОбластьСтроки.Область(1, 1).ЦветТекста = WebЦвета.Серый;
		ДокументРезультат.Вывести(ОбластьСтроки);
	КонецЦикла;
	
КонецПроцедуры

	//Использование
	//Отчет "График Производства"     

Функция ТаблицаЭтаповДляГрафикаПроизводства(ГруппаСпецификаций = Неопределено, ГруппаВидовНоменклатуры = Неопределено, КонтрагентОтбор = Неопределено, ПодразделениеОтбор = Неопределено, НаименованиеСодержит = Неопределено, ДатаДо = Неопределено)
	Запрос = Новый Запрос;
	//BSLLS:https:RefOveruse-off
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЭтапыСИзделиями.Ссылка КАК Ссылка,
	               |	ЭтапыСИзделиями.Статус КАК Статус,
	               |	МАКСИМУМ(ЭтапыСИзделиями.КоличествоУпаковокПлан) КАК КоличествоУпаковокПлан,
	               |	МАКСИМУМ(ЭтапыСИзделиями.КоличествоУпаковокФакт) КАК КоличествоУпаковокФакт,
	               |	МАКСИМУМ(ЭтапыСИзделиями.КоличествоУпаковокОтменено) КАК КоличествоУпаковокОтменено,
	               |	ЭтапыСИзделиями.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	               |	ЭтапыСИзделиями.ДатаПотребности КАК ДатаПотребности,
	               |	ЭтапыСИзделиями.ПриоритетЗаказа КАК ПриоритетЗаказа,
	               |	ЭтапыСИзделиями.ГруппаСпецификации КАК ГруппаСпецификации,
				   |	ЭтапыСИзделиями.Подразделение КАК Подразделение,
	               |	ЭтапыСИзделиями.Номенклатура КАК Номенклатура,
	               |	ЭтапыСИзделиями.Код КАК Код,
	               |	ЭтапыСИзделиями.Характеристика КАК Характеристика,
	               |	ЭтапыСИзделиями.ГруппаВидовНоменклатуры КАК ГруппаВидовНоменклатуры,
	               |	МАКСИМУМ(ВЫРАЗИТЬ(ЭтапыСИзделиями.ИПП КАК СТРОКА(250))) КАК ИПП,
	               |	МАКСИМУМ(ЭтапыСИзделиями.КоличествоУпаковокПлан) - МАКСИМУМ(ЭтапыСИзделиями.КоличествоУпаковокФакт) - МАКСИМУМ(ЭтапыСИзделиями.КоличествоУпаковокОтменено) КАК КоличествоУпаковокДолг,
	               |	ЭтапыСИзделиями.ДоговорОснования КАК ДоговорОснования,
	               |	ВЫРАЗИТЬ(ЭтапыСИзделиями.КомментарийВЗаказеКлиента КАК СТРОКА(250)) КАК КомментарийВЗаказеКлиента,
	               |	ЭтапыСИзделиями.Контрагент КАК Контрагент
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ЭтапПроизводства2_2.Ссылка КАК Ссылка,
	               |		ЭтапПроизводства2_2.Статус КАК Статус,
	               |		ЭтапПроизводства2_2.КоличествоУпаковокПлан КАК КоличествоУпаковокПлан,
	               |		ЭтапПроизводства2_2.КоличествоУпаковокФакт КАК КоличествоУпаковокФакт,
	               |		ЭтапПроизводства2_2.КоличествоУпаковокОтменено КАК КоличествоУпаковокОтменено,
	               |		ЭтапПроизводства2_2.Распоряжение.Ссылка КАК ЗаказНаПроизводство,
	               |		ЕСТЬNULL(ЭтапПроизводства2_2.Распоряжение.ДатаПотребности, ЭтапПроизводства2_2.Распоряжение.Дата) КАК ДатаПотребности,
	               |		ЭтапПроизводства2_2.Распоряжение.Приоритет КАК ПриоритетЗаказа,
	               |		ЭтапПроизводства2_2.Спецификация.Родитель КАК ГруппаСпецификации,
				   |		ЭтапПроизводства2_2.Подразделение КАК Подразделение,
	               |		ЕСТЬNULL(ЭтапПроизводстваВыходныеИзделия.Номенклатура.Ссылка, ЭтапПроизводстваПобочныеИзделия.Номенклатура) КАК Номенклатура,
	               |		ЕСТЬNULL(ЭтапПроизводстваВыходныеИзделия.Номенклатура.Код, ЭтапПроизводстваПобочныеИзделия.Номенклатура.Код) КАК Код,
	               |		ЕСТЬNULL(ЭтапПроизводстваВыходныеИзделия.Характеристика, ЭтапПроизводстваПобочныеИзделия.Характеристика) КАК Характеристика,
	               |		ЕСТЬNULL(ЭтапПроизводстваВыходныеИзделия.Номенклатура.ВидНоменклатуры.Родитель, ЭтапПроизводстваПобочныеИзделия.Номенклатура.ВидНоменклатуры.Родитель) КАК ГруппаВидовНоменклатуры,
	               |		ВЫРАЗИТЬ(ЕСТЬNULL(ИППВыходныеИзделия.Значение, ИПППобочныеИзделия.Значение) КАК СТРОКА) КАК ИПП,
	               |		ЗаказКлиентаДанные.Договор КАК ДоговорОснования,
	               |		ЗаказКлиентаДанные.Комментарий КАК КомментарийВЗаказеКлиента,
	               |		ЗаказКлиентаДанные.Контрагент КАК Контрагент
	               |	ИЗ
	               |		Документ.ЭтапПроизводства2_2 КАК ЭтапПроизводства2_2
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК ЭтапПроизводстваВыходныеИзделия
	               |			ПО ЭтапПроизводства2_2.Ссылка = ЭтапПроизводстваВыходныеИзделия.Ссылка
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2.ПобочныеИзделия КАК ЭтапПроизводстваПобочныеИзделия
	               |			ПО ЭтапПроизводства2_2.Ссылка = ЭтапПроизводстваПобочныеИзделия.Ссылка
	               |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				ВЫРАЗИТЬ(ДополнительныеСведенияВыходные.Объект КАК Справочник.Номенклатура) КАК Номенклатура,
	               |				ДополнительныеСведенияВыходные.Значение КАК Значение
	               |			ИЗ
	               |				РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведенияВыходные
	               |					ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК СвойствоИППВыходные
	               |					ПО ДополнительныеСведенияВыходные.Свойство = СвойствоИППВыходные.Ссылка
	               |			ГДЕ
	               |				СвойствоИППВыходные.Наименование = ""ИПП""
	               |				И ТИПЗНАЧЕНИЯ(ДополнительныеСведенияВыходные.Объект) = ТИП(Справочник.Номенклатура)) КАК ИППВыходныеИзделия
	               |			ПО ЭтапПроизводстваВыходныеИзделия.Номенклатура = ИППВыходныеИзделия.Номенклатура
	               |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				ВЫРАЗИТЬ(ДополнительныеСведенияПобочные.Объект КАК Справочник.Номенклатура) КАК Номенклатура,
	               |				ДополнительныеСведенияПобочные.Значение КАК Значение
	               |			ИЗ
	               |				РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведенияПобочные
	               |					ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК СвойствоИПППобочные
	               |					ПО ДополнительныеСведенияПобочные.Свойство = СвойствоИПППобочные.Ссылка
	               |			ГДЕ
	               |				СвойствоИПППобочные.Наименование = ""ИПП""
	               |				И ТИПЗНАЧЕНИЯ(ДополнительныеСведенияПобочные.Объект) = ТИП(Справочник.Номенклатура)) КАК ИПППобочныеИзделия
	               |			ПО ЭтапПроизводстваПобочныеИзделия.Номенклатура = ИПППобочныеИзделия.Номенклатура
	               |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				ЗаказКлиентаВнутр.Ссылка КАК Ссылка,
	               |				ЕСТЬNULL(ЗаказКлиентаВнутр.ЗаказКлиента.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) КАК Договор,
	               |				ЕСТЬNULL(ЗаказКлиентаВнутр.ЗаказКлиента.Комментарий, """") КАК Комментарий,
	               |				ЕСТЬNULL(ЗаказКлиентаВнутр.ЗаказКлиента.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Контрагент
	               |			ИЗ
	               |				(ВЫБРАТЬ
	               |					ЭтапПроизводства2_2_Заказ.Ссылка КАК Ссылка,
	               |					ВЫБОР
	               |						КОГДА ТИПЗНАЧЕНИЯ(ЭтапПроизводства2_2_Заказ.Распоряжение.ДокументОснование) = ТИП(Документ.ЗаказКлиента)
	               |							ТОГДА ВЫРАЗИТЬ(ЭтапПроизводства2_2_Заказ.Распоряжение.ДокументОснование КАК Документ.ЗаказКлиента)
	               |						КОГДА ТИПЗНАЧЕНИЯ(ЭтапПроизводства2_2_Заказ.Распоряжение.ДокументОснование) = ТИП(Документ.ЗаказДавальца)
	               |							ТОГДА ВЫРАЗИТЬ(ЭтапПроизводства2_2_Заказ.Распоряжение.ДокументОснование КАК Документ.ЗаказДавальца)
	               |						ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	               |					КОНЕЦ КАК ЗаказКлиента
	               |				ИЗ
	               |					Документ.ЭтапПроизводства2_2 КАК ЭтапПроизводства2_2_Заказ) КАК ЗаказКлиентаВнутр) КАК ЗаказКлиентаДанные
	               |			ПО ЭтапПроизводства2_2.Ссылка = ЗаказКлиентаДанные.Ссылка
	               |	ГДЕ
	               |		ЭтапПроизводства2_2.Проведен
	               |		И ЭтапПроизводства2_2.Статус В(&Статусы)
	               |		И ЭтапПроизводства2_2.КоличествоУпаковокПлан - ЭтапПроизводства2_2.КоличествоУпаковокФакт - ЭтапПроизводства2_2.КоличествоУпаковокОтменено > 0
	               |		И (&ГруппаСпецификаций = ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПустаяСсылка)
	               |			ИЛИ ЭтапПроизводства2_2.Спецификация.Родитель = &ГруппаСпецификаций)
	               |		И (&ГруппаВидовНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.ПустаяСсылка)
	               |			ИЛИ ЭтапПроизводстваВыходныеИзделия.Номенклатура.ВидНоменклатуры В ИЕРАРХИИ(&ГруппаВидовНоменклатуры)
	               |			ИЛИ ЭтапПроизводстваПобочныеИзделия.Номенклатура.ВидНоменклатуры В ИЕРАРХИИ(&ГруппаВидовНоменклатуры))
	               |		И (&КонтрагентОтбор = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |			ИЛИ ЕСТЬNULL(ЗаказКлиентаДанные.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = &КонтрагентОтбор)
	               |		И (&ПодразделениеОтбор = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	               |			ИЛИ ЭтапПроизводства2_2.Подразделение = &ПодразделениеОтбор)
	               |		И (&ДатаДо = ДАТАВРЕМЯ(1, 1, 1)
	               |			ИЛИ ЕСТЬNULL(ЭтапПроизводства2_2.Распоряжение.ДатаПотребности, ЭтапПроизводства2_2.Распоряжение.Дата) МЕЖДУ ДАТАВРЕМЯ(1, 1, 1) И &ДатаДо)) КАК ЭтапыСИзделиями
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ЭтапыСИзделиями.Ссылка,
	               |		ЭтапыСИзделиями.Статус,
	               |		ЭтапыСИзделиями.ЗаказНаПроизводство,
	               |		ЭтапыСИзделиями.ДатаПотребности,
	               |		ЭтапыСИзделиями.ПриоритетЗаказа,
	               |		ЭтапыСИзделиями.ГруппаСпецификации,
				   |		ЭтапыСИзделиями.Подразделение,
	               |		ЭтапыСИзделиями.Номенклатура,
	               |		ЭтапыСИзделиями.Код,
	               |		ЭтапыСИзделиями.Характеристика,
	               |		ЭтапыСИзделиями.ГруппаВидовНоменклатуры,
	               |		ЭтапыСИзделиями.ДоговорОснования,
	               |		ВЫРАЗИТЬ(ЭтапыСИзделиями.КомментарийВЗаказеКлиента КАК СТРОКА(250)),
	               |		ЭтапыСИзделиями.Контрагент";
	//BSLLS:https:RefOveruse-on
	МассивСтатусов = Новый Массив;
	МассивСтатусов.Добавить(Перечисления.СтатусыЭтаповПроизводства2_2.Сформирован);
	МассивСтатусов.Добавить(Перечисления.СтатусыЭтаповПроизводства2_2.КВыполнению);
	МассивСтатусов.Добавить(Перечисления.СтатусыЭтаповПроизводства2_2.Начат);	
	Запрос.УстановитьПараметр("Статусы", МассивСтатусов);
	Запрос.УстановитьПараметр("ГруппаСпецификаций", ?(ГруппаСпецификаций <> Неопределено, ГруппаСпецификаций, Справочники.РесурсныеСпецификации.ПустаяСсылка()));
	Запрос.УстановитьПараметр("ГруппаВидовНоменклатуры", ?(ГруппаВидовНоменклатуры <> Неопределено, ГруппаВидовНоменклатуры, Справочники.ВидыНоменклатуры.ПустаяСсылка()));
	Запрос.УстановитьПараметр("КонтрагентОтбор", ?(КонтрагентОтбор <> Неопределено, КонтрагентОтбор, Справочники.Контрагенты.ПустаяСсылка()));
	Запрос.УстановитьПараметр("ПодразделениеОтбор", ?(ПодразделениеОтбор <> Неопределено, ПодразделениеОтбор, Справочники.СтруктураПредприятия.ПустаяСсылка())); 
	Запрос.УстановитьПараметр("ДатаДо", ?(ДатаДо <> Неопределено,  КонецДня(ДатаДо), Дата(1, 1, 1))); 
	Если НаименованиеСодержит <> Неопределено И СокрЛП(НаименованиеСодержит) <> "" Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, 
			")) КАК ЭтапыСИзделиями",
			")
	               |		И ВЫРАЗИТЬ(ЕСТЬNULL(ЭтапПроизводстваВыходныеИзделия.Номенклатура.Наименование, ЭтапПроизводстваПобочныеИзделия.Номенклатура.Наименование) КАК СТРОКА(150)) ПОДОБНО &НаименованиеСодержит) КАК ЭтапыСИзделиями");
		Запрос.УстановитьПараметр("НаименованиеСодержит", "%" + СокрЛП(НаименованиеСодержит) + "%");
	КонецЕсли;

	Таб = Запрос.Выполнить().Выгрузить();
	Возврат Таб;
КонецФункции
